ptpress_tags = {
    "75424c57-6dd7-4d1f-b6b9-8e95773c0593": "经管",
    "def2b966-997b-447e-b69b-7bc84c66afcf": "工业现代化",
    "cb1ecdd6-9881-421c-bc1e-ee97687e83f2": "少儿",
    "c1a5d9df-a107-4b42-a16a-45e3a46b6e43": "集邮",
    "33af7e88-7ac9-4b91-9ff7-15e521dadc21": "科普",
    "afc45c33-b36b-45e4-81c8-059e0c6cce07": "生活娱乐",
    "4370ad12-9b5d-4850-bead-ce551a8c6d9f": "机电",
    "2a8f1030-fa2f-403a-9f38-76cfe875c184": "电子",
    "a15a734f-0ae9-41d7-9012-6ef9de2e71c8": "计算机",
    "34858549-baec-4292-b5f0-23064a7ccb6f": "数学与统计学",
    "923f77a9-018e-4872-9326-cf9c255a2a32": "通信",
    "d922af09-f90a-448b-8c8c-b54625faf31f": "交通",
    "5ba1b7ee-ccd7-4221-add5-f83fa7490e9d": "外语",
    "4b25c8b3-7d73-4504-9594-5fdbd7446915": "心理学",
    "f5ff17be-e61e-4e42-a313-ffe7dc99db75": "艺术传媒",
    "a870aadd-0094-4185-a79b-e26f7310ff67": "其他"
}

ptpress_mapping = {
    "经管": "商业与管理",
    "工业现代化": "工程与技术",
    "少儿": "K12教育",
    "集邮": "市场营销",
    "科普": "科普",
    "生活娱乐": "自我提升",
    "机电": "机械工程",
    "电子": "电子工程",
    "计算机": "计算机科学",
    "数学与统计学": "数学",
    "通信": "计算机网络",
    "交通": "工程与技术",
    "外语": "语言学",
    "心理学": "心理学",
    "艺术传媒": "艺术学",
    "其他": "课程与教学"
}